Revit 2027 API
SpecTypeId.String Class
 This class contains constants identifying string specs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpecTypeId.String
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class String
Public NotInheritable Class String
public ref class String abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type String = class end
The SpecTypeId.String type exposes the following members.
Properties
Name | Description
MultilineText |  Multiline Text, in discipline Common.
Text |  Text, in discipline Common.
Url |  URL, in discipline Common.
Top
See Also
Reference
Autodesk.Revit.DB Namespace